; domain
;Header and description

(define (domain dock-worker-robot-pos)

;remove requirements that are not needed
(:requirements :strips :typing :disjunctive-preconditions)

(:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
    container
    location
    pile
    robot
    crane
)

; un-comment following line if constants are needed
(:constants 
    pallet - container
)

(:predicates ;todo: define predicates here
    (adjacent ?l1 ?l2 - location)
    (attached ?p - pile ?l - location)
    (belong ?k - crane ?l - location)
    (at ?r - robot ?l - location)
    (free ?l - location)
    (loaded ?r - robot ?c - container)
    (unloaded ?r - robot)
    (holding ?k - crane ?c - container)
    (empty ?k - crane)
    (in ?c - container ?p - pile)
    (top ?c - container ?p - pile)
    (on ?c1 - container ?c2 - container)

)


(:functions ;todo: define numeric functions here
)

;define actions here
; (predicate ?vars)
(:action move
    :parameters (?r - robot ?from ?to - location)
    :precondition (and (at ?r ?from)
                       (adjacent ?from ?to)
                       (free ?to)
    )
    :effect (and (free ?from)
                 (not (free ?to))
                 (at ?r ?to)
                 (not (at ?r ?from))
    )
)

(:action load
    :parameters (?r - robot ?c - container ?k - crane ?l - location)
    :precondition (and (unloaded ?r)
                       (belong ?k ?l)
                       (at ?r ?l)
                       (holding ?k ?c)

    )
    :effect (and (empty ?k)
                 (loaded ?r ?c)
                 (not (unloaded ?r))
                 (not (holding ?k ?c)))
)

(:action unload
    :parameters (?r - robot ?c - container ?k - crane ?l - location)
    :precondition (and (loaded ?r ?c)
                       (belong ?k ?l)
                       (at ?r ?l)
                       (empty ?k)
    )
    :effect (and (holding ?k ?c)
                 (unloaded ?r)
                 (not (loaded ?r ?c))
                 (not (empty ?k))

    )
)

(:action take
    :parameters (?c1 ?c2 - container ?p - pile ?k - crane ?l - location)
    :precondition (and (attached ?p ?l)
                       (belong ?k ?l)
                       (on ?c1 ?c2)
                       (in ?c1 ?p)
                       (top ?c1 ?p)
                       (empty ?k)
    )
    :effect (and (not (on ?c1 ?c2))
                 (not (top ?c1 ?p))
                 (not (empty ?k))
                 (not (in ?c1 ?p))
                 (top ?c2 ?p)
                 (holding ?k ?c1)
    )
)

(:action put
    :parameters (?c1 ?c2 - container ?p - pile ?k - crane ?l - location)
    :precondition (and (top ?c2 ?p)
                       (holding ?k ?c1)
                       (attached ?p ?l)
                       (belong ?k ?l)
    )
    :effect (and (on ?c1 ?c2)
                 (top ?c1 ?p)
                 (in ?c1 ?p)
                 (empty ?k)
                 (not (top ?c2 ?p))
                 (not (holding ?k ?c1))
                 
    )

)




)

; problem
(define (problem dwr-problem1) (:domain dock-worker-robot-pos)
(:objects
    r1 - robot
    l1 l2 - location
    k1 k2 - crane
    p1 q1 p2 q2 - pile
    ca cb cc cd ce cf - container
)

(:init
    ;todo: put the initial state's facts and numeric values here
    (adjacent l1 l2) (adjacent l2 l1)
    (attached p1 l1) (attached q1 l1) (attached p2 l2) (attached q2 l2)
    (belong k1 l1) (belong k2 l2)

    (in ca p1) (in cb p1) (in cc p1) (in cd q1) (in ce q1) (in cf q1)
    (on ca pallet) (on cb ca) (on cc cb) (on cd pallet) (on ce cd) (on cf ce)
    (top cc p1) (top cf q1) (top pallet p2) (top pallet q2)

    (at r1 l1)
    (unloaded r1)
    (free l2)

    (empty k1) (empty k2)

)

(:goal
    (and (in ca p2)
         (in cb q2)
         (in cc p2)
         (in cd q2)
         (in ce q2)
         (in cf q2)))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (take cc cb p1 k1 l1)
   deleted: (on cc cb) (top cc p1) (empty k1) (in cc p1)
   added: (top cb p1) (holding k1 cc)
   goals met: 0 of 6
2. (load r1 cc k1 l1)
   deleted: (unloaded r1) (holding k1 cc)
   added: (empty k1) (loaded r1 cc)
   goals met: 0 of 6
3. (move r1 l1 l2)
   deleted: (free l2) (at r1 l1)
   added: (free l1) (at r1 l2)
   goals met: 0 of 6
4. (unload r1 cc k2 l2)
   deleted: (loaded r1 cc) (empty k2)
   added: (holding k2 cc) (unloaded r1)
   goals met: 0 of 6
5. (put cc pallet p2 k2 l2)
   deleted: (top pallet p2) (holding k2 cc)
   added: (on cc pallet) (top cc p2) (in cc p2) (empty k2)
   goals met: 1 of 6
6. (take cb ca p1 k1 l1)
   deleted: (on cb ca) (top cb p1) (empty k1) (in cb p1)
   added: (top ca p1) (holding k1 cb)
   goals met: 1 of 6
7. (move r1 l2 l1)
   deleted: (free l1) (at r1 l2)
   added: (free l2) (at r1 l1)
   goals met: 1 of 6
8. (load r1 cb k1 l1)
   deleted: (unloaded r1) (holding k1 cb)
   added: (empty k1) (loaded r1 cb)
   goals met: 1 of 6
9. (move r1 l1 l2)
   deleted: (free l2) (at r1 l1)
   added: (free l1) (at r1 l2)
   goals met: 1 of 6
10. (unload r1 cb k2 l2)
   deleted: (loaded r1 cb) (empty k2)
   added: (holding k2 cb) (unloaded r1)
   goals met: 1 of 6
11. (put cb pallet q2 k2 l2)
   deleted: (top pallet q2) (holding k2 cb)
   added: (on cb pallet) (top cb q2) (in cb q2) (empty k2)
   goals met: 2 of 6
12. (take cf ce q1 k1 l1)
   deleted: (on cf ce) (top cf q1) (empty k1) (in cf q1)
   added: (top ce q1) (holding k1 cf)
   goals met: 2 of 6
13. (move r1 l2 l1)
   deleted: (free l1) (at r1 l2)
   added: (free l2) (at r1 l1)
   goals met: 2 of 6
14. (load r1 cf k1 l1)
   deleted: (unloaded r1) (holding k1 cf)
   added: (empty k1) (loaded r1 cf)
   goals met: 2 of 6
15. (move r1 l1 l2)
   deleted: (free l2) (at r1 l1)
   added: (free l1) (at r1 l2)
   goals met: 2 of 6
16. (unload r1 cf k2 l2)
   deleted: (loaded r1 cf) (empty k2)
   added: (holding k2 cf) (unloaded r1)
   goals met: 2 of 6
17. (put cf cb q2 k2 l2)
   deleted: (top cb q2) (holding k2 cf)
   added: (on cf cb) (top cf q2) (in cf q2) (empty k2)
   goals met: 3 of 6
18. (take ce cd q1 k1 l1)
   deleted: (on ce cd) (top ce q1) (empty k1) (in ce q1)
   added: (top cd q1) (holding k1 ce)
   goals met: 3 of 6
19. (move r1 l2 l1)
   deleted: (free l1) (at r1 l2)
   added: (free l2) (at r1 l1)
   goals met: 3 of 6
20. (load r1 ce k1 l1)
   deleted: (unloaded r1) (holding k1 ce)
   added: (empty k1) (loaded r1 ce)
   goals met: 3 of 6
21. (move r1 l1 l2)
   deleted: (free l2) (at r1 l1)
   added: (free l1) (at r1 l2)
   goals met: 3 of 6
22. (unload r1 ce k2 l2)
   deleted: (loaded r1 ce) (empty k2)
   added: (holding k2 ce) (unloaded r1)
   goals met: 3 of 6
23. (put ce cf q2 k2 l2)
   deleted: (top cf q2) (holding k2 ce)
   added: (on ce cf) (top ce q2) (in ce q2) (empty k2)
   goals met: 4 of 6
24. (move r1 l2 l1)
   deleted: (free l1) (at r1 l2)
   added: (free l2) (at r1 l1)
   goals met: 4 of 6
25. (take ca pallet p1 k1 l1)
   deleted: (on ca pallet) (top ca p1) (empty k1) (in ca p1)
   added: (top pallet p1) (holding k1 ca)
   goals met: 4 of 6
26. (load r1 ca k1 l1)
   deleted: (unloaded r1) (holding k1 ca)
   added: (empty k1) (loaded r1 ca)
   goals met: 4 of 6
27. (move r1 l1 l2)
   deleted: (free l2) (at r1 l1)
   added: (free l1) (at r1 l2)
   goals met: 4 of 6
28. (unload r1 ca k2 l2)
   deleted: (loaded r1 ca) (empty k2)
   added: (holding k2 ca) (unloaded r1)
   goals met: 4 of 6
29. (take cd pallet q1 k1 l1)
   deleted: (on cd pallet) (top cd q1) (empty k1) (in cd q1)
   added: (top pallet q1) (holding k1 cd)
   goals met: 4 of 6
30. (put ca cc p2 k2 l2)
   deleted: (top cc p2) (holding k2 ca)
   added: (on ca cc) (top ca p2) (in ca p2) (empty k2)
   goals met: 5 of 6
31. (move r1 l2 l1)
   deleted: (free l1) (at r1 l2)
   added: (free l2) (at r1 l1)
   goals met: 5 of 6
32. (load r1 cd k1 l1)
   deleted: (unloaded r1) (holding k1 cd)
   added: (empty k1) (loaded r1 cd)
   goals met: 5 of 6
33. (move r1 l1 l2)
   deleted: (free l2) (at r1 l1)
   added: (free l1) (at r1 l2)
   goals met: 5 of 6
34. (unload r1 cd k2 l2)
   deleted: (loaded r1 cd) (empty k2)
   added: (holding k2 cd) (unloaded r1)
   goals met: 5 of 6
35. (put cd ce q2 k2 l2)
   deleted: (top ce q2) (holding k2 cd)
   added: (on cd ce) (top cd q2) (in cd q2) (empty k2)
   goals met: 6 of 6
